Revit 2027 API
NumberingSchema.MaximumStartingNumber Property
 A static property defining the maximum number a numbering sequence can use as its starting number (the lowest number in the sequence).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static int MaximumStartingNumber { get; }
Public Shared ReadOnly Property MaximumStartingNumber As Integer
	Get
public:
static property int MaximumStartingNumber {
	int get ();
}
static member MaximumStartingNumber : int with get
Property Value
Int32
Remarks
 Use this method to ensure a value given to the ShiftNumbers is within the valid range.
See Also
Reference
NumberingSchema Class
Autodesk.Revit.DB Namespace